CFDEMcoupling-MATHEGRAM/tutorials/cfdemSolverBuoyantPimple/subsonic_nozzleFlow/CFD/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1000;

boundaryField
{
    "(wall|outlet)"
    {
        type            fixedFluxPressure;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 1000;
    }
}

// ************************************************************************* //
