CFDEMcoupling-MATHEGRAM/tutorials/cfdemSolverBuoyantPimple/subsonic_nozzleFlow/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.;


vertices
(
    (0.   0.    0.)
    (6e-3 0.    0.)
    (6e-3 20e-3 0.)
    (0.   20e-3 0.)

    (0.   0.    62e-3)
    (6e-3 0.    62e-3)
    (6e-3 20e-3 62e-3)
    (0    20e-3 62e-3)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (3 1 31) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall inlet
    (
        (0 3 2 1)
    )
    wall outlet
    (
        (4 5 6 7)
    )
    wall wall
    (
        (3 7 6 2)
        (1 5 4 0)
        (0 4 7 3)
        (2 6 5 1)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
